src/InformationRegisters/МФМакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>МФМакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСуществует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МакетСуществует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МакетСовпадает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МФМакеты/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПустаяСтрока(Параметры.ЗначениеКопирования.ИмяФормы) Тогда
		ТекстМакета = РеквизитФормыВЗначение("Запись").Макет.Получить();
	Иначе
		ТекстМакета = РегистрыСведений.МФМакеты.МакетОписанияМодификаций(
			Запись.ИмяФормы,
			Запись.ИмяМакета
		).ПолучитьТекст();
		Запись.ИмяФормы = "";
	КонецЕсли;
	ОбновитьОформлениеЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Сжатие = Новый СжатиеДанных(9);
	ТекущийОбъект.Макет = Новый ХранилищеЗначения(
		ТекстМакета,
		Сжатие
	);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьОформлениеЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОформлениеЭлементов()
	Если Запись.ФормаСуществует Тогда
		Элементы.ГруппаИмяФормы.ЦветФона = Новый Цвет();
		Элементы.ИмяФормы.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.СтатусФормы.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИмяФормы.ЦветФона = ЦветаСтиля.МФЦветОтсутствующихОбъектов;
		Элементы.ИмяФормы.ЦветТекстаЗаголовка = ЦветаСтиля.МФЦветВыделенныхНадписей;
		Элементы.СтатусФормы.Видимость = Истина;
	КонецЕсли;
	
	Если Не Запись.МакетСуществует Тогда
		Элементы.ГруппаИмяМакета.ЦветФона = ЦветаСтиля.МФЦветОтсутствующихОбъектов;
		Элементы.ИмяМакета.ЦветТекстаЗаголовка = ЦветаСтиля.МФЦветВыделенныхНадписей;
		Элементы.СтатусМакета.Видимость = Истина;
		Элементы.СтатусМакета.Заголовок = НСтр("ru='Макет не существует'");
	ИначеЕсли Не Запись.МакетСовпадает Тогда
		Элементы.ГруппаИмяМакета.ЦветФона = ЦветаСтиля.МФЦветРазличающихсяМакетов;
		Элементы.ИмяМакета.ЦветТекстаЗаголовка = ЦветаСтиля.МФЦветВыделенныхНадписей;
		Элементы.СтатусМакета.Видимость = Истина;
		Элементы.СтатусМакета.Заголовок = НСтр("ru='Макет в кэше отличается от макета в конфигурации'");
	Иначе
		Элементы.ГруппаИмяМакета.ЦветФона = Новый Цвет();
		Элементы.ИмяМакета.ЦветТекстаЗаголовка = Новый Цвет();
		Элементы.СтатусМакета.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
